app/controllers/site/page_controller.rb

SELECT "homemessages".* FROM "homemessages"
---
  def messages
    @mensages = Homemessage.all