app/controllers/site/page_controller.rb

  def index
    @mensage = Homemessage.new
    @mensages = Homemessage.find(:all, limit: 2, :conditions => ["approved = ?", true], :order => "created_at DESC")
---
SELECT "homemessages".* FROM "homemessages" WHERE (approved = 't') ORDER BY created_at DESC LIMIT 2

  def submit
    @mensage = Homemessage.create(params[:homemessage])
---
INSERT INTO "homemessages" ("approved", "created_at", "message", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["approved", false], ["created_at", Sat, 31 Aug 2013 20:28:59 BRT -03:00], ["message", "aiuhahauhui"], ["name", "Marcos"], ["updated_at", Sat, 31 Aug 2013 20:28:59 BRT -03:00]]

  def submit_fee
    @cota = Fee.create(params[:fee])
    @cota.value = params[:value_other] unless @cota.value != 0
    if @cota.save
---
INSERT INTO "fees" ("confirm_deposit", "created_at", "email", "message", "name", "outros", "updated_at", "value") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "fees".* FROM "fees" WHERE (confirm_deposit = 't')
UPDATE "fees" SET "value" = 0, "updated_at" = '2013-04-14 20:27:59.866881' WHERE "fees"."id" = 13

  def messages
    # set per_page globally
    #WillPaginate.per_page = 8
    @mensages = Homemessage.paginate(:page => params[:page], per_page: 3, order: "created_at DESC").where(approved: true)
---
SELECT "homemessages".* FROM "homemessages" WHERE "homemessages"."approved" = 't'
SELECT COUNT(*) FROM "homemessages" WHERE "homemessages"."approved" = 't'