app/controllers/site/presence_controller.rb

  def members
    @all = Member.all
---
SELECT "members".* FROM "members" WHERE (lower(name) like '%and%')

  def family
    param = params[:parametrize_name]
    parametrize = param.gsub("-", " ").downcase
    @member_from_url = Member.find(:first, conditions: ["lower(name) like ?", "%#{parametrize}%"]);
    @family = Family.find(@member_from_url.family_id)
    @members = Member.find(:all, conditions: ["family_id = ?", "#{@member_from_url.family_id}"])
    @followers = Follower.find(:all, conditions: ["family_id = ?", "#{@member_from_url.family_id}"])
---
SELECT "members".* FROM "members" WHERE (lower(name) like '%maurílio assunção%') LIMIT 1
SELECT "families".* FROM "families" WHERE "families"."id" = $1 LIMIT 1  [["id", 25]]
SELECT "followers".* FROM "followers" WHERE (family_id = '25')

  def confirm
    param = params[:parametrize_name]
    parametrize = param.gsub("-", " ").downcase
    @member_from_url = Member.find(:first, conditions: ["lower(name) like ?", "%#{parametrize}%"]);
    @member_from_url.confirmado = true
    @member_from_url.save
---
SELECT "members".* FROM "members" WHERE (lower(name) like '%alexandre tande%') LIMIT 1
UPDATE "members" SET "confirmado" = 't', "updated_at" = '2013-08-17 15:15:13.437087' WHERE "members"."id" = 214

  def cancel
    param = params[:parametrize_name]
    parametrize = param.gsub("-", " ").downcase
    @member_from_url = Member.find(:first, conditions: ["lower(name) like ?", "%#{parametrize}%"]);
    @member_from_url.confirmado = false
    @member_from_url.save
---
SELECT "members".* FROM "members" WHERE (lower(name) like '%alexandre tande%') LIMIT 1
UPDATE "members" SET "confirmado" = 'f', "updated_at" = '2013-08-17 15:15:16.816190' WHERE "members"."id" = 214

  def add_follower
    family = params[:family]
    name = params[:follower]
    descricao = params[:text][:detalhes]
    @follower = Follower.create(name: name, family_id: family, description: descricao)
---
INSERT INTO "followers" ("created_at", "description", "family_id", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sat, 17 Aug 2013 12:15:53 BRT -03:00], ["description", "Amiga da Taisa"], ["family_id", 42], ["name", "Thaís"], ["updated_at", Sat, 17 Aug 2013 12:15:53 BRT -03:00]]