app/controllers/administrador/acompanhante_controller.rb

SELECT "followers".* FROM "followers"
---
	def index
		@follower = Follower.all

SELECT "followers".* FROM "followers" WHERE "followers"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "followers" WHERE "followers"."id" = $1  [["id", 2]]
---
	def destroy
		u = Follower.find(params[:id])
		if u.destroy