app/controllers/administrador/contato_controller.rb

SELECT "contatos".* FROM "contatos"
---
  def index
    @mensagens = Contato.all