app/controllers/administrador/families_controller.rb

SELECT "families".* FROM "families"
---
  def index
    @families = Family.all

SELECT "families".* FROM "families" WHERE "families"."id" = ? LIMIT 1  [["id", "5"]]
SELECT "members".* FROM "members" WHERE (family_id = '5')
SELECT "followers".* FROM "followers" WHERE (family_id = '5')
---
  def show
    @family = Family.find(params[:id])
    @members = Member.find(:all, conditions: ["family_id = ?", params[:id]])
    @followers = Follower.find(:all, conditions: ["family_id = ?", params[:id]])

INSERT INTO "families" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 18 May 2013 14:08:20 BRT -03:00], ["name", "Marcos Santini"], ["updated_at", Sat, 18 May 2013 14:08:20 BRT -03:00]]
SELECT "members".* FROM "members" WHERE "members"."name" = 'Marcos Santini' LIMIT 1
INSERT INTO "members" ("confirmado", "created_at", "family_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["confirmado", false], ["created_at", Sat, 18 May 2013 14:10:57 BRT -03:00], ["family_id", 3], ["name", "Marcos Santini"], ["updated_at", Sat, 18 May 2013 14:10:57 BRT -03:00]]
---
  def create
    @family = Family.new(params[:family])
    if @family.save
      u = Member.find_by_name(@family.name)

      if u.nil?
        novoMembro = Member.new({name: @family.name, family_id: @family.id})
        novoMembro.save!

SELECT "families".* FROM "families" WHERE "families"."id" = ? LIMIT 1  [["id", "5"]]
---
  def edit
    @family = Family.find(params[:id])

SELECT "families".* FROM "families" WHERE "families"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "families" SET "name" = 'Marcos Santini test', "updated_at" = '2013-05-18 17:32:34.521400' WHERE "families"."id" = 5
---
  def update
    @family = Family.find(params[:id])
    if @family.update_attributes(params[:family])

SELECT "families".* FROM "families" WHERE "families"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "families" WHERE "families"."id" = ?  [["id", 1]]
---
  def destroy
    @family = Family.find(params[:id])
    if @family.destroy