app/controllers/administrador/fee_controller.rb

SELECT "fees".* FROM "fees"
---
  def index
    @fee = Fee.all