app/controllers/administrador/homemessage_controller.rb

SELECT "families".* FROM "families" WHERE "families"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def destroy
    @family = Family.find(params[:id])