app/controllers/administrador/homemessage_controller.rb

SELECT "homemessages".* FROM "homemessages"
---
  def index
    @homemessages = Homemessage.all

SELECT "homemessages".* FROM "homemessages" WHERE "homemessages"."id" = $1 LIMIT 1  [["id", "8"]]
UPDATE "homemessages" SET "approved" = 't', "updated_at" = '2013-09-01 00:38:09.438499' WHERE "homemessages"."id" = 8
---
  def aprovar
    @homemessage = Homemessage.find(params[:id])
    @homemessage.approved = true
    @homemessage.save!

SELECT "homemessages".* FROM "homemessages" WHERE "homemessages"."id" = $1 LIMIT 1  [["id", "10"]]
UPDATE "homemessages" SET "approved" = 'f', "updated_at" = '2013-09-01 00:43:59.309153' WHERE "homemessages"."id" = 10
---
  def reprovar
    @homemessage = Homemessage.find(params[:id])
    @homemessage.approved = false
    @homemessage.save!

SELECT "homemessages".* FROM "homemessages" WHERE "homemessages"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "homemessages" WHERE "homemessages"."id" = $1  [["id", 1]]
---
  def destroy
    @homemessage = Homemessage.find(params[:id])
    if @homemessage.destroy