app/controllers/administrador/listing_controller.rb

SELECT "members".* FROM "members" WHERE "members"."confirmado" = 't' ORDER BY name ASC
---
	def index
		@u = Member.order("name ASC").where(confirmado: true)