app/controllers/administrador/listing_controller.rb

SELECT "members".* FROM "members" ORDER BY name ASC
---
	def index
		@u = Member.order("name ASC")