app/controllers/administrador/members_controller.rb

  def index
    @membros = Member.all
---
SELECT "members".* FROM "members"

  def new
    @member = Member.new
    @families = Family.all
---
SELECT "families".* FROM "families"

  def create
    @member = Member.new(params[:member])
    @member.family_id = params[:familia_id]

    if @member.save
---
INSERT INTO "members" ("confirmado", "created_at", "family_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["confirmado", false], ["created_at", Sat, 18 May 2013 14:26:54 BRT -03:00], ["family_id", 5], ["name", "taisa pires"], ["updated_at", Sat, 18 May 2013 14:26:54 BRT -03:00]]

  def edit
    @member = Member.find(params[:id])
    @families = Family.all
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "5"]]
SELECT "families".* FROM "families"

  def update
    @member = Member.find(params[:id])
    if @member.update_attributes(params[:member])
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "members" SET "name" = 'taisa pires test', "updated_at" = '2013-05-18 17:40:30.327400' WHERE "members"."id" = 5

  def destroy
    @member = Member.find(params[:id])
    if @member.destroy
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 4]]